Tekla Open API Reference for Tekla Structures 2025
HierarchicObject.Definition Property
 The hierarchical definition which the hierarchical object is associated with.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public HierarchicDefinition Definition { get; set; }
Public Property Definition As HierarchicDefinition
	Get
	Set
Property Value
Type: HierarchicDefinition
See Also
Reference
HierarchicObject Class
Tekla.Structures.Model Namespace